package org.javaguru.student_aleksey_volokitin.lesson_9_inheritance.homework.day_3_plus.task_1_plus;

/*
    Напишите ответы на вопросы тут.

    Что такое абстрактный класс?
        Абстрактный класс – это класс, который используется как шаблон для других классов.
        Может содержать как абстрактные методы (без реализации), так и обычные методы (с реализацией).
        Наследуется через extends.

    Можно ли создать экземпляр абстрактного класса в момент выполнения программы?
        Нельзя, но можно создать экземпляр класса-наследника.
*/
abstract class AbstractClass {

}
